'''
Напишите программу Python, которая принимает слово от пользователя и переворачивает его
'''

some_text = str(input('Введите слово'))
print(some_text[::-1])